# Напишем программку, которая будет тестировать мои знания новых английских слов.

def main():
    """
    ОПИСАНИЕ ПРОГРАММЫ:
    Программа будет высвечивать слово либо на английском,либо на русском и предлагать
    пользователю ввести правильный перевод. В случае ошибки, программа потребует еще
    раз ввести правильный перевод. Если же ответ правильный,то программа переходит к
    следующему слову.Так же будет подсчитывать статистику правильных ответов ( с какого
    раза удалось ответить правильно ).!!!! Как пример,возьми задачку по игре"камень-ножницы-бумага"!!!!
    ЧТО ПОНАДОБИТСЯ:
    1) Создать базу слов с переводом
    2) Используя random и циклы написать модуль, который будет генерировать случайные
       слова в случайном порядке.
    3) Написать модуль, который будет задавать вопрос и проверять правильность ответа
    :return:
    """
    pass
